-- 취향 목록
INSERT INTO taste (name, parent_id) VALUES
                                        ('전시회', NULL),   -- id = 1
                                        ('콘서트', NULL),   -- id = 2
                                        ('뮤지컬/연극', NULL), -- id = 3
                                        ('클래식/무용', NULL); -- id = 4

-- 전시회 하위 항목
INSERT INTO taste (name, parent_id) VALUES
                                        ('팝업 전시', 1),
                                        ('사진 전시', 1),
                                        ('현대미술', 1),
                                        ('설치미술', 1),
                                        ('디지털 아트', 1),
                                        ('건축 전시', 1),
                                        ('장식미술', 1),
                                        ('문화 전시', 1),
                                        ('과학 전시', 1),
                                        ('역사 전시', 1);

-- 콘서트 하위 항목
INSERT INTO taste (name, parent_id) VALUES
                                        ('팝', 2),
                                        ('랩/힙합', 2),
                                        ('락/메탈', 2),
                                        ('케이팝', 2),
                                        ('팬미팅', 2),
                                        ('페스티벌', 2),
                                        ('트로트', 2),
                                        ('발라드', 2),
                                        ('인디', 2),
                                        ('토크/강연', 2);

-- 뮤지컬/연극 하위 항목
INSERT INTO taste (name, parent_id) VALUES
                                        ('드라마', 3),
                                        ('코미디', 3),
                                        ('로맨스', 3),
                                        ('판타지', 3),
                                        ('스릴러', 3),
                                        ('실험극', 3),
                                        ('역사극', 3),
                                        ('오리지널/내한', 3),
                                        ('창작', 3),
                                        ('라이선스', 3);

-- 클래식/무용 하위 항목
INSERT INTO taste (name, parent_id) VALUES
                                        ('오케스트라', 4),
                                        ('오페라', 4),
                                        ('발레', 4),
                                        ('현대무용', 4),
                                        ('전통무용', 4),
                                        ('국악', 4);

-- 태그 목록 --
insert into tag (name) values ('전시회') , ('콘서트'), ('뮤지컬') , ('영화제');
insert into tag (name) values ('동행구함') , ('티켓 있음'), ('현장 구매') , ('스탠딩'), ('무대 인사');
insert into tag (name) values ('남성 환영') , ('여성 환영'), ('중앙 블럭') , ('통로석');
insert into tag (name) values ('10대 환영') , ('20대 환영'), ('30대 블럭') , ('40대 환영'), ('연령 무관');

