-- 취향 목록 --
insert into taste (name, parent_id) values ('전시회', null) , ('콘서트', null), ('뮤지컬', null) , ('영화제', null), ('관람 목적', null);
insert into taste (name, parent_id) values ('팝업 전시', 1) , ('사진 전시', 1), ('현대미술', 1) , ('설치미술', 1),('디지털 전시', 1) , ('건축 전시', 1), ('장식미술', 1) , ('문화전시', 1), ('과학 전시', 1) , ('역사 전시', 1);
insert into taste (name, parent_id) values ('클래식', 2) , ('팝', 2), ('락/메탈', 2) , ('재즈', 2), ('랩/힙합', 2) , ('K팝', 2), ('팬미팅', 2) , ('트로트', 2), ('인디', 2) , ('토크/강연', 2), ('페스티벌', 2);
insert into taste (name, parent_id) values ('드라마', 3) , ('코미디', 3), ('로맨스', 3) , ('오페라', 3), ('판타지', 3) , ('스릴러', 3), ('실험극', 3) , ('역사극', 3), ('오리지널', 3) , ('창작', 3), ('라이선스', 3);
insert into taste (name, parent_id) values ('독립영화', 4) , ('다큐멘터리', 4), ('애니메이션', 4) , ('고전', 4), ('판타지', 4) , ('호러', 4), ('로맨스', 4) , ('코미디', 4), ('여성', 4) , ('음악', 4), ('유아', 4);
insert into taste (name, parent_id) values ('지식 습득', 5) , ('휴식 및 힐링', 5), ('사회적 활동', 5) , ('영감 및 창의성', 5), ('기타', 5);

-- 태그 목록 --
insert into tag (name) values ('전시회') , ('콘서트'), ('뮤지컬') , ('영화제');
insert into tag (name) values ('동행구함') , ('티켓 있음'), ('현장 구매') , ('스탠딩'), ('무대 인사');
insert into tag (name) values ('남성 환영') , ('여성 환영'), ('중앙 블럭') , ('통로석');
insert into tag (name) values ('10대 환영') , ('20대 환영'), ('30대 블럭') , ('40대 환영'), ('연령 무관');

